
# ðŸ§© Titanic Dataset Exploration with pandas

ðŸŽ¯ **Goal:**  
In this notebook, you'll explore the Titanic dataset using **pandas**.  
You'll practice the most common pandas functions for data inspection, selection, filtering, cleaning, and analysis.

For each function in the list below:
1. Explain what it does (in your own words, in a Markdown cell).
2. Give at least **two examples** using the Titanic dataset.
3. Add a short comment about the output or why itâ€™s useful.

In [ ]:

import pandas as pd

# Load Titanic dataset
# (Make sure titanic.csv is in the same folder as this notebook)
df = pd.read_csv("titanic_dataset.csv")


## ðŸ§  Step 1: Inspecting the Data

Functions to explore:
- df.head()
- df.tail()
- df.info()
- df.describe()
- df.shape
- df.columns

### df.head()

 muestras las primer filas del dataframe tomando por defecto 5

In [ ]:

# Ejemplo: df.head()
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Ejemplo 2
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

### df.tail()

Muestra las Ãºltimas filas del dataframe tomando por defecto 5

In [ ]:
#Ejemplo: df.tail()
df.tail() #Ãšltimas 5 filas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [ ]:
#Ejemplo 2
df.tail(2)  #Ãšltimas 2 filas

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

### df.info()

Muestra un resumen de datos del DataFrame estos son:


Cantidad de filas y columnas,
Nombres de las columnas,
Tipos de datos y
Valores nulos

In [ ]:
#Ejemplo: df.info()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
#Ejemplo 2 
df2 = pd.DataFrame({
    "Nombre": ["Ana", "Luis", "MarÃ­a"],
    "Edad": [23, None, 19],
    "Ciudad": ["Madrid", "Sevilla", "Barcelona"]
})
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Nombre  3 non-null      object
 1   Edad    2 non-null      float64
 2   Ciudad  3 non-null      object
dtypes: float64(1), object(2)
memory usage: 204.0+ bytes

### df.describe()

 Muestra datos estadÃ­sticos de las columnas con valores numÃ©ricos, algunos de estos datos estos son:
Media,
DesviaciÃ³n,
MÃ­nimo,
MÃ¡ximo y
Porcentajes

In [ ]:
#Ejemplo: df.describe()
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
#Ejemplo 2
df2 = pd.DataFrame({
    "Altura": [1.75, 1.60, 1.82, 1.90],
    "Peso": [70, 55, 80, 90]
})
df2.describe()

         Altura       Peso
count  4.000000   4.000000
mean   1.767500  73.750000
std    0.127377  14.930394
min    1.600000  55.000000
25%    1.712500  66.250000
50%    1.785000  75.000000
75%    1.840000  82.500000
max    1.900000  90.000000

### df.shape()

Devuelve una tupla con las dimensiones del dataframe

In [ ]:
#Ejemplo: df.shape()
df.shape

(891, 12)

In [ ]:
#Ejemplo 2
filas, columnas = df.shape
print(f"El titanic_dataset tiene {filas} filas y {columnas} columnas")

El titanic_dataset tiene 891 filas y 12 columnas

### df.columns()

Devuelve una lista con los nombres de las columnas

In [ ]:
#Ejemplo: df.columns
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
#Ejemplo 2
for columna in df.columns:
    print("Columna:", columna)


## ðŸ” Step 2: Selecting Data
Functions to explore:
- df["column"]
- df[["col1", "col2"]]
- df.loc[]
- df.iloc[]

### df["column"]

Devuelve una lista con los nombres de las columnas

In [ ]:
# Ejemplo: df["column"]
df["Age"].head()

In [ ]:
#Ejemplo 2
df["Sex"].head()

### df[["col1","col2"]]

Selecciona varias columnas a la vez y devuelve un Dataframe con sus valores

In [ ]:
# Ejemplo: df[["col","col2"]] 
df[["Sex", "Age", "Survived"]].head()

In [ ]:
# Ejemplo 2
df[["Pclass", "Survived"]].head()

### df.loc[]

Selecciona filas y columnas por etiquetas

In [ ]:
#Ejemplo: df.loc[]
df.loc[0, "Name"]

In [ ]:
#Ejemplo 2
df.loc[0:4, ["Name", "Age", "Sex"]]

### df.iloc[]

Selecciona filas y columnas por su posiciÃ³n numÃ©rica

In [ ]:
#Ejemplo: df.iloc[]
df.iloc[0]

In [ ]:
#Ejemplo 2
df.iloc[0:3, 1:4]


## ðŸ”Ž Step 3: Filtering Rows

Functions to explore:
- df[df["Age"] > 30]
- df.query("Sex == 'female' and Survived == 1")

### df[df["column"] > 30]

Filtra y devuelve las filas donde la columna cumple con las condiciones asignadas

In [ ]:

#Ejemplo : df[df["column"]]
df[df["Age"] > 50].head()

In [ ]:
#Ejemplo 2
df[(df["Age"] > 30) & (df["Sex"] == "male")]

### df.query()

Usa la sintaxis de consulta tipo SQL para filtrar filas don se cumplan condiciones expresadas

In [ ]:
#Ejemplo df.query()
df.query("Sex == 'female' and Survived == 1").head()

In [ ]:
#Ejemplo 2
df.query("Sex == 'male' and Survived == 0 and Age < 20").head()


## ðŸ§¹ Step 4: Handling Missing Data

Functions to explore:
- df.isna()
- df.isna().sum()
- df.dropna()
- df.fillna()

### df.isna()

Devuelve un DataFrame de valores boolean indicando si las cada celda tiene valor NaN o None(True si falta el dato)

In [ ]:
#Ejemplo df.isna()
df.isna()

In [ ]:
#Ejemplo 2
df[df.isna().any(axis=1)].head()

### df.isna().sum()

Cuenta cuantos valores NaN hay en cada columna

In [ ]:
# Ejemplo df.isna.sum()
df.isna().sum()

In [ ]:
# Ejemplo 2
df.isna().sum().sum()

### df.dropna()

Elimina filas o columnas con valores nulos

In [ ]:
# Ejemplo df.dropna()
df_sin_nulos = df.dropna()
df_sin_nulos

In [ ]:
#Ejemplo 2
df_col = df.dropna(axis=1)
df_col

### df.fillna()

Rellena los valores nulos con un valor

In [ ]:
# Ejemplo df.fillna()
df_text = df.fillna("Desconocido")
df_text.head

In [ ]:

# Ejemplo 2
df["Age"] = df["Age"].fillna(df["Age"].median())
df["Age"].head()


## ðŸ“Š Step 5: Grouping and Aggregating

Functions to explore:
- df.groupby("Sex")["Survived"].mean()
- df["Fare"].mean()
- df["Age"].median()

### df.groupby("column1")["column2"]

Agrupa los datos por la columna1 y calcula el promedio de la segunda columna para cada grupo

In [ ]:

# Ejemplo groupby()
df.groupby("Sex")["Survived"].mean()

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [ ]:
# Ejemplo 2
df.groupby("Pclass")["Fare"].mean()

### df["colum1"].mean()

Calcula la media de la columna

In [ ]:
#Ejemplo .mean()
df["Fare"].mean()

In [ ]:
# Ejemplo 2
df["Age"].mean()

### df.["columna"].median()

Calcula la mediana de la columna

In [ ]:
# Ejemplo .median()
df["Age"].median()

In [ ]:
# Ejemplo 2
df["Fare"].median()


## ðŸ“ˆ Step 6: Sorting and Counting

Functions to explore:
- df.sort_values("Age")
- df["Sex"].unique()
- df["Pclass"].value_counts()

### df.sort_values("column")

Ordena los valores de la columna de menos a mayor

In [ ]:

# Ejemplo df.sort.values()
df.sort_values("Age").head()

In [ ]:
# Ejemplo 2 (descendente)
df.sort_values("Age", ascending=False).head()

### df.["column"].unique()

Devuelve un array con los valores unicos de las columnas

In [ ]:
# Ejemplo df[""].unique()
df["Sex"].unique()

In [ ]:
# Ejemplo 2
df["Age"].unique()

### df["column"].value_counts()

Cuenta cuantas veces aparece cada valor en la columna

In [ ]:
# Ejemplo df[""].value_counts()
df["Pclass"].value_counts()

In [ ]:
# Ejemplo 2
df["Sex"].value_counts()


## âš™ï¸ Step 7: Creating or Modifying Columns

Functions to explore:
- df.assign()
- df.apply()
- df["new_col"] = ...
- pd.concat()
- pd.merge()

### df.assign()

Crea columnas en el DataFrame sin modificar el original delvolviendo una copia del mismo

In [ ]:
# Ejemplo df.assign()
df2 = df.assign(Age_2 = df["Age"] * 2)
df2.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_group,Total_Family,Fare_per_Age,Ship,Age_2
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Adult,1,0.329545,Titanic,44.0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Adult,1,1.875876,Titanic,76.0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Adult,0,0.304808,Titanic,52.0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Adult,1,1.517143,Titanic,70.0
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Adult,0,0.230000,Titanic,70.0

In [ ]:
# Ejemplo 2
df2 = df.assign(Fare_per_Age = df["Fare"] / df["Age"])
df2.head()

### df.apply()

Aplica funciones a cada elemento, columna o fila del DataFrame

In [ ]:
# Ejemplo df.apply()
df["Age_group"] = df["Age"].apply(lambda x: "Young" if x < 18 else "Adult")
df["Age_group"]

0      Adult
1      Adult
2      Adult
3      Adult
4      Adult
       ...
886    Adult
887    Adult
888    Adult
889    Adult
890    Adult
Name: Age_group, Length: 891, dtype: object

In [ ]:
# Ejemplo 2
df["Total_Family"] = df.apply(lambda row: row["SibSp"] + row["Parch"], axis=1)
df["Total_Family"]

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Name: Total_Family, Length: 891, dtype: int64

### df["new_col"]

Crea o modifica una columna del DataFrame original

In [ ]:
# Ejemplo df["new_col"]
df["Fare_per_Age"] = df["Fare"] / df["Age"]
df[["Age", "Fare", "Fare_per_Age"]].head()

    Age     Fare  Fare_per_Age
0  22.0   7.2500      0.329545
1  38.0  71.2833      1.875876
2  26.0   7.9250      0.304808
3  35.0  53.1000      1.517143
4  35.0   8.0500      0.230000

In [ ]:
# Ejemplo 2
df["Ship"] = "Titanic"
df["Ship"]

### pd.concat()

Une DataFrames por filas o columnas

In [ ]:
# Ejemplo pd.concat()
df_combined = pd.concat([df[["Name"]], df[["Age"]]], axis=1)
df_combined

                                                  Name   Age
0                              Braund, Mr. Owen Harris  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                               Heikkinen, Miss. Laina  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                             Allen, Mr. William Henry  35.0
..                                                 ...   ...
886                              Montvila, Rev. Juozas  27.0
887                       Graham, Miss. Margaret Edith  19.0
888           Johnston, Miss. Catherine Helen "Carrie"   NaN
889                              Behr, Mr. Karl Howell  26.0
890                                Dooley, Mr. Patrick  32.0

[891 rows x 2 columns]

In [ ]:
# Ejemplo 2
df_test = pd.DataFrame({
    "PassengerId": [4, 5],
    "Survived": [1, 0],
    "Pclass": [1, 3],
    "Name": ["Futrelle, Mrs. Jacques", "Allen, Mr. William"],
    "Sex": ["female", "male"],
    "Age": [35, 35],
    "Fare": [53.1, 8.05]
})
df_train = pd.DataFrame({
    "PassengerId": [1, 2, 3],
    "Survived": [0, 1, 1],
    "Pclass": [3, 1, 3],
    "Name": ["Braund, Mr. Owen", "Cumings, Mrs. John", "Heikkinen, Miss. Laina"],
    "Sex": ["male", "female", "female"],
    "Age": [22, 38, 26],
    "Fare": [7.25, 71.2833, 7.925]
})
df_total = pd.concat([df_train, df_test])
df_total.head()

   PassengerId  Survived  Pclass                    Name     Sex  Age     Fare
0            1         0       3        Braund, Mr. Owen    male   22   7.2500
1            2         1       1      Cumings, Mrs. John  female   38  71.2833
2            3         1       3  Heikkinen, Miss. Laina  female   26   7.9250
0            4         1       1  Futrelle, Mrs. Jacques  female   35  53.1000
1            5         0       3      Allen, Mr. William    male   35   8.0500

### pd.merge()

Combina dos DataFrames  por una columna comun (Join en SQL)

In [ ]:
#Ejemplo pd.merge
df_personal = df[["PassengerId", "Name", "Sex", "Age", "Pclass"]]
df_supervivencia = df[["PassengerId", "Survived"]]

df_final = pd.merge(df_personal, df_supervivencia, on="PassengerId", how="inner")
df_final.head()

,PassengerId,Name,Sex,Age,Pclass,Survived
0,1,"Braund, Mr. Owen Harris",male,22.0,3,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,1
2,3,"Heikkinen, Miss. Laina",female,26.0,3,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,1
4,5,"Allen, Mr. William Henry",male,35.0,3,0
...,...,...,...,...,...,...
886,887,"Montvila, Rev. Juozas",male,27.0,2,0
887,888,"Graham, Miss. Margaret Edith",female,19.0,1,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,3,0
889,890,"Behr, Mr. Karl Howell",male,26.0,1,1
890,891,"Dooley, Mr. Patrick",male,32.0,3,0

In [ ]:
# Ejemplo 2
df_economico = df[["PassengerId", "Ticket", "Fare", "Cabin", "Embarked"]]
df_final = pd.merge(df_personal, df_economico, on="PassengerId", how="inner")
df_final.head()

,PassengerId,Name,Sex,Age,Pclass,Ticket,Fare,Cabin,Embarked
0,1,"Braund, Mr. Owen Harris",male,22.0,3,A/5 21171,7.2500,NaN,S
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,"Heikkinen, Miss. Laina",female,26.0,3,STON/O2. 3101282,7.9250,NaN,S
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,5,"Allen, Mr. William Henry",male,35.0,3,373450,8.0500,NaN,S


## ðŸ’¾ Step 8: Exporting Data

Function to explore:
- df.to_csv("output.csv", index=False)

### df.to_csv()

Guarda el contenido de un DataFrame en un arhcivo CSV

In [ ]:
# Ejemplo df.to_csv()
##df.to_csv("titanic_cleaned.csv", index=False)

In [ ]:
# Ejemplo 2
##df_total[["Name", "Sex", "Age"]].to_csv("pasajeros.csv", index=False)


## ðŸ§© Step 9: Summary

Reflect on what you learned:
- Which functions were most useful?
- What insights did you gain from the Titanic dataset?

### Â¿QuÃ© funciones fueron mÃ¡s Ãºtiles?

Las funciones mÃ¡s Ãºtiles fueron df.info() y df.value_counts(), ya que la primera es la esencial para obtener una vision generalizada de los distintos DataFrame y despuÃ©s 
df.value_counts() para analizar las distintas tasas de interes como las tasas de supervivencia por gÃ©nero o clase.

### Â¿QuÃ© informaciÃ³n obtuviste del dataset del Titanic?

La informaciÃ³n mÃ¡s intesante que descubrÃ­ es que las tasas de supervivencia reflejan claramente los patrones sociales de la Ã©poca, los cuales,lamentablemente, no distan mucho de los actuales.

La edad y la clase del billete influyeron significatimante al resultado demostrando que los pasajeros de primera clase tuvieron un porcentaje mÃ¡s elevado que los de tercera, y lo mismo con los menores de edad que tienen una tasa mucho mÃ¡s elevada que el resto.

El gÃ©nero tambiÃ©n tiene gran influencia en las posibilidades pero esa informaciÃ³n es conocida por la famosa pelÃ­cula mÃ¡s que por este dataset.